Tekla Open API Reference for Tekla Structures 2025
FontAttributes.Bold Property
 Whether the font is bold.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Bold { get; set; }
Public Property Bold As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
FontAttributes Class
Tekla.Structures.Drawing Namespace